arendst/Tasmota/arduino/version pre-2.6.0/boards.txt
##############################################################
arduino-esp8266.name=Arduino
arduino-esp8266.build.board=ESP8266_ARDUINO
arduino-esp8266.menu.BoardModel.primo=Primo
arduino-esp8266.menu.BoardModel.primo.build.board=ESP8266_ARDUINO_PRIMO
arduino-esp8266.menu.BoardModel.primo.build.extra_flags=-DF_CRYSTAL=40000000 -DESP8266
arduino-esp8266.menu.BoardModel.primo.build.variant=arduino_spi
arduino-esp8266.menu.BoardModel.starottodeved=Star OTTO
arduino-esp8266.menu.BoardModel.starottodeved.build.board=ESP8266_ARDUINO_STAR_OTTO
arduino-esp8266.menu.BoardModel.starottodeved.build.extra_flags=-DF_CRYSTAL=40000000 -DESP8266
arduino-esp8266.menu.BoardModel.starottodeved.build.variant=arduino_uart
arduino-esp8266.menu.BoardModel.unowifideved=Uno WiFi
arduino-esp8266.menu.BoardModel.unowifideved.build.board=ESP8266_ARDUINO_UNOWIFI
arduino-esp8266.menu.BoardModel.unowifideved.build.extra_flags=-DF_CRYSTAL=40000000 -DESP8266
arduino-esp8266.menu.BoardModel.unowifideved.build.variant=arduino_uart
arduino-esp8266.upload.tool=esptool
arduino-esp8266.upload.maximum_data_size=81920
arduino-esp8266.upload.wait_for_upload_port=true
arduino-esp8266.upload.erase_cmd=version
arduino-esp8266.serial.disableDTR=true
arduino-esp8266.serial.disableRTS=true
arduino-esp8266.build.mcu=esp8266
arduino-esp8266.build.core=esp8266
arduino-esp8266.build.variant=generic
arduino-esp8266.build.spiffs_pagesize=256
arduino-esp8266.build.debug_port=
arduino-esp8266.build.debug_level=
arduino-esp8266.menu.xtal.80=80 MHz
arduino-esp8266.menu.xtal.80.build.f_cpu=80000000L
arduino-esp8266.menu.xtal.160=160 MHz
arduino-esp8266.menu.xtal.160.build.f_cpu=160000000L
arduino-esp8266.menu.vt.flash=Flash
arduino-esp8266.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
arduino-esp8266.menu.vt.heap=Heap
arduino-esp8266.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
arduino-esp8266.menu.vt.iram=IRAM
arduino-esp8266.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
arduino-esp8266.menu.exception.legacy=Legacy (new can return nullptr)
arduino-esp8266.menu.exception.legacy.build.exception_flags=-fno-exceptions
arduino-esp8266.menu.exception.legacy.build.stdcpp_lib=-lstdc++
arduino-esp8266.menu.exception.disabled=Disabled (new can abort)
arduino-esp8266.menu.exception.disabled.build.exception_flags=-fno-exceptions -DNEW_OOM_ABORT
arduino-esp8266.menu.exception.disabled.build.stdcpp_lib=-lstdc++
arduino-esp8266.menu.exception.enabled=Enabled
arduino-esp8266.menu.exception.enabled.build.exception_flags=-fexceptions
arduino-esp8266.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
arduino-esp8266.menu.ssl.all=All SSL ciphers (most compatible)
arduino-esp8266.menu.ssl.all.build.sslflags=
arduino-esp8266.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
arduino-esp8266.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
arduino-esp8266.upload.resetmethod=ck
arduino-esp8266.build.flash_mode=qio
arduino-esp8266.build.flash_flags=-DFLASHMODE_QIO
arduino-esp8266.build.flash_freq=40
arduino-esp8266.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
arduino-esp8266.menu.eesz.4M2M.build.flash_size=4M
arduino-esp8266.menu.eesz.4M2M.build.flash_size_bytes=0x400000
arduino-esp8266.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
arduino-esp8266.menu.eesz.4M2M.build.spiffs_pagesize=256
arduino-esp8266.menu.eesz.4M2M.upload.maximum_size=1044464
arduino-esp8266.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
arduino-esp8266.menu.eesz.4M2M.build.spiffs_start=0x200000
arduino-esp8266.menu.eesz.4M2M.build.spiffs_end=0x3FA000
arduino-esp8266.menu.eesz.4M2M.build.spiffs_blocksize=8192
arduino-esp8266.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
arduino-esp8266.menu.eesz.4M3M.build.flash_size=4M
arduino-esp8266.menu.eesz.4M3M.build.flash_size_bytes=0x400000
arduino-esp8266.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
arduino-esp8266.menu.eesz.4M3M.build.spiffs_pagesize=256
arduino-esp8266.menu.eesz.4M3M.upload.maximum_size=1044464
arduino-esp8266.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
arduino-esp8266.menu.eesz.4M3M.build.spiffs_start=0x100000
arduino-esp8266.menu.eesz.4M3M.build.spiffs_end=0x3FA000
arduino-esp8266.menu.eesz.4M3M.build.spiffs_blocksize=8192
arduino-esp8266.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
arduino-esp8266.menu.eesz.4M1M.build.flash_size=4M
arduino-esp8266.menu.eesz.4M1M.build.flash_size_bytes=0x400000
arduino-esp8266.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
arduino-esp8266.menu.eesz.4M1M.build.spiffs_pagesize=256
arduino-esp8266.menu.eesz.4M1M.upload.maximum_size=1044464
arduino-esp8266.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
arduino-esp8266.menu.eesz.4M1M.build.spiffs_start=0x300000
arduino-esp8266.menu.eesz.4M1M.build.spiffs_end=0x3FA000
arduino-esp8266.menu.eesz.4M1M.build.spiffs_blocksize=8192
arduino-esp8266.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
arduino-esp8266.menu.eesz.4M.build.flash_size=4M
arduino-esp8266.menu.eesz.4M.build.flash_size_bytes=0x400000
arduino-esp8266.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
arduino-esp8266.menu.eesz.4M.build.spiffs_pagesize=256
arduino-esp8266.menu.eesz.4M.upload.maximum_size=1044464
arduino-esp8266.menu.eesz.4M.build.rfcal_addr=0x3FC000
arduino-esp8266.menu.ip.lm2f=v2 Lower Memory
arduino-esp8266.menu.ip.lm2f.build.lwip_include=lwip2/include
arduino-esp8266.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
arduino-esp8266.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
arduino-esp8266.menu.ip.hb2f=v2 Higher Bandwidth
arduino-esp8266.menu.ip.hb2f.build.lwip_include=lwip2/include
arduino-esp8266.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
arduino-esp8266.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
arduino-esp8266.menu.ip.lm2n=v2 Lower Memory (no features)
arduino-esp8266.menu.ip.lm2n.build.lwip_include=lwip2/include
arduino-esp8266.menu.ip.lm2n.build.lwip_lib=-llwip2-536
arduino-esp8266.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
arduino-esp8266.menu.ip.hb2n=v2 Higher Bandwidth (no features)
arduino-esp8266.menu.ip.hb2n.build.lwip_include=lwip2/include
arduino-esp8266.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
arduino-esp8266.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
arduino-esp8266.menu.ip.lm6f=v2 IPv6 Lower Memory
arduino-esp8266.menu.ip.lm6f.build.lwip_include=lwip2/include
arduino-esp8266.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
arduino-esp8266.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
arduino-esp8266.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
arduino-esp8266.menu.ip.hb6f.build.lwip_include=lwip2/include
arduino-esp8266.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
arduino-esp8266.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
arduino-esp8266.menu.ip.hb1=v1.4 Higher Bandwidth
arduino-esp8266.menu.ip.hb1.build.lwip_lib=-llwip_gcc
arduino-esp8266.menu.ip.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
arduino-esp8266.menu.ip.src=v1.4 Compile from source
arduino-esp8266.menu.ip.src.build.lwip_lib=-llwip_src
arduino-esp8266.menu.ip.src.build.lwip_flags=-DLWIP_OPEN_SRC
arduino-esp8266.menu.ip.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
arduino-esp8266.menu.dbg.Disabled=Disabled
arduino-esp8266.menu.dbg.Disabled.build.debug_port=
arduino-esp8266.menu.dbg.Serial=Serial
arduino-esp8266.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
arduino-esp8266.menu.dbg.Serial1=Serial1
arduino-esp8266.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
arduino-esp8266.menu.lvl.None____=None
arduino-esp8266.menu.lvl.None____.build.debug_level=
arduino-esp8266.menu.lvl.SSL=SSL
arduino-esp8266.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
arduino-esp8266.menu.lvl.TLS_MEM=TLS_MEM
arduino-esp8266.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
arduino-esp8266.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
arduino-esp8266.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
arduino-esp8266.menu.lvl.HTTP_SERVER=HTTP_SERVER
arduino-esp8266.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
arduino-esp8266.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
arduino-esp8266.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
arduino-esp8266.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
arduino-esp8266.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
arduino-esp8266.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
arduino-esp8266.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
arduino-esp8266.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
arduino-esp8266.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
arduino-esp8266.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
arduino-esp8266.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
arduino-esp8266.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
arduino-esp8266.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
arduino-esp8266.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
arduino-esp8266.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
arduino-esp8266.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
arduino-esp8266.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
arduino-esp8266.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
arduino-esp8266.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
arduino-esp8266.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
arduino-esp8266.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
arduino-esp8266.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
arduino-esp8266.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
arduino-esp8266.menu.lvl.CORE=CORE
arduino-esp8266.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
arduino-esp8266.menu.lvl.WIFI=WIFI
arduino-esp8266.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
arduino-esp8266.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
arduino-esp8266.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
arduino-esp8266.menu.lvl.UPDATER=UPDATER
arduino-esp8266.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
arduino-esp8266.menu.lvl.OTA=OTA
arduino-esp8266.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
arduino-esp8266.menu.lvl.OOM=OOM
arduino-esp8266.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
arduino-esp8266.menu.lvl.MDNS=MDNS
arduino-esp8266.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
arduino-esp8266.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
arduino-esp8266.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
arduino-esp8266.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
arduino-esp8266.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
arduino-esp8266.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
arduino-esp8266.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
arduino-esp8266.menu.wipe.none=Only Sketch
arduino-esp8266.menu.wipe.none.upload.erase_cmd=version
arduino-esp8266.menu.wipe.sdk=Sketch + WiFi Settings
arduino-esp8266.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
arduino-esp8266.menu.wipe.all=All Flash Contents
arduino-esp8266.menu.wipe.all.upload.erase_cmd=erase_flash
arduino-esp8266.menu.baud.115200=115200
arduino-esp8266.menu.baud.115200.upload.speed=115200
arduino-esp8266.menu.baud.57600=57600
arduino-esp8266.menu.baud.57600.upload.speed=57600
arduino-esp8266.menu.baud.230400.linux=230400
arduino-esp8266.menu.baud.230400.macosx=230400
arduino-esp8266.menu.baud.230400.upload.speed=230400
arduino-esp8266.menu.baud.256000.windows=256000
arduino-esp8266.menu.baud.256000.upload.speed=256000
arduino-esp8266.menu.baud.460800.linux=460800
arduino-esp8266.menu.baud.460800.macosx=460800
arduino-esp8266.menu.baud.460800.upload.speed=460800
arduino-esp8266.menu.baud.512000.windows=512000
arduino-esp8266.menu.baud.512000.upload.speed=512000
arduino-esp8266.menu.baud.921600=921600
arduino-esp8266.menu.baud.921600.upload.speed=921600
arduino-esp8266.menu.baud.3000000=3000000
arduino-esp8266.menu.baud.3000000.upload.speed=3000000

