arendst/Tasmota/arduino/version pre-2.6.0/boards.txt
##############################################################
wifiduino.name=WiFiduino
wifiduino.build.board=WIFIDUINO_ESP8266
wifiduino.build.variant=wifiduino
wifiduino.upload.tool=esptool
wifiduino.upload.maximum_data_size=81920
wifiduino.upload.wait_for_upload_port=true
wifiduino.upload.erase_cmd=version
wifiduino.serial.disableDTR=true
wifiduino.serial.disableRTS=true
wifiduino.build.mcu=esp8266
wifiduino.build.core=esp8266
wifiduino.build.spiffs_pagesize=256
wifiduino.build.debug_port=
wifiduino.build.debug_level=
wifiduino.menu.xtal.80=80 MHz
wifiduino.menu.xtal.80.build.f_cpu=80000000L
wifiduino.menu.xtal.160=160 MHz
wifiduino.menu.xtal.160.build.f_cpu=160000000L
wifiduino.menu.vt.flash=Flash
wifiduino.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
wifiduino.menu.vt.heap=Heap
wifiduino.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
wifiduino.menu.vt.iram=IRAM
wifiduino.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
wifiduino.menu.exception.legacy=Legacy (new can return nullptr)
wifiduino.menu.exception.legacy.build.exception_flags=-fno-exceptions
wifiduino.menu.exception.legacy.build.stdcpp_lib=-lstdc++
wifiduino.menu.exception.disabled=Disabled (new can abort)
wifiduino.menu.exception.disabled.build.exception_flags=-fno-exceptions -DNEW_OOM_ABORT
wifiduino.menu.exception.disabled.build.stdcpp_lib=-lstdc++
wifiduino.menu.exception.enabled=Enabled
wifiduino.menu.exception.enabled.build.exception_flags=-fexceptions
wifiduino.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
wifiduino.menu.ssl.all=All SSL ciphers (most compatible)
wifiduino.menu.ssl.all.build.sslflags=
wifiduino.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
wifiduino.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
wifiduino.upload.resetmethod=nodemcu
wifiduino.build.flash_mode=dio
wifiduino.build.flash_flags=-DFLASHMODE_DIO
wifiduino.build.flash_freq=40
wifiduino.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
wifiduino.menu.eesz.4M2M.build.flash_size=4M
wifiduino.menu.eesz.4M2M.build.flash_size_bytes=0x400000
wifiduino.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
wifiduino.menu.eesz.4M2M.build.spiffs_pagesize=256
wifiduino.menu.eesz.4M2M.upload.maximum_size=1044464
wifiduino.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
wifiduino.menu.eesz.4M2M.build.spiffs_start=0x200000
wifiduino.menu.eesz.4M2M.build.spiffs_end=0x3FA000
wifiduino.menu.eesz.4M2M.build.spiffs_blocksize=8192
wifiduino.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
wifiduino.menu.eesz.4M3M.build.flash_size=4M
wifiduino.menu.eesz.4M3M.build.flash_size_bytes=0x400000
wifiduino.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
wifiduino.menu.eesz.4M3M.build.spiffs_pagesize=256
wifiduino.menu.eesz.4M3M.upload.maximum_size=1044464
wifiduino.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
wifiduino.menu.eesz.4M3M.build.spiffs_start=0x100000
wifiduino.menu.eesz.4M3M.build.spiffs_end=0x3FA000
wifiduino.menu.eesz.4M3M.build.spiffs_blocksize=8192
wifiduino.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
wifiduino.menu.eesz.4M1M.build.flash_size=4M
wifiduino.menu.eesz.4M1M.build.flash_size_bytes=0x400000
wifiduino.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
wifiduino.menu.eesz.4M1M.build.spiffs_pagesize=256
wifiduino.menu.eesz.4M1M.upload.maximum_size=1044464
wifiduino.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
wifiduino.menu.eesz.4M1M.build.spiffs_start=0x300000
wifiduino.menu.eesz.4M1M.build.spiffs_end=0x3FA000
wifiduino.menu.eesz.4M1M.build.spiffs_blocksize=8192
wifiduino.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
wifiduino.menu.eesz.4M.build.flash_size=4M
wifiduino.menu.eesz.4M.build.flash_size_bytes=0x400000
wifiduino.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
wifiduino.menu.eesz.4M.build.spiffs_pagesize=256
wifiduino.menu.eesz.4M.upload.maximum_size=1044464
wifiduino.menu.eesz.4M.build.rfcal_addr=0x3FC000
wifiduino.menu.ip.lm2f=v2 Lower Memory
wifiduino.menu.ip.lm2f.build.lwip_include=lwip2/include
wifiduino.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
wifiduino.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
wifiduino.menu.ip.hb2f=v2 Higher Bandwidth
wifiduino.menu.ip.hb2f.build.lwip_include=lwip2/include
wifiduino.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
wifiduino.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
wifiduino.menu.ip.lm2n=v2 Lower Memory (no features)
wifiduino.menu.ip.lm2n.build.lwip_include=lwip2/include
wifiduino.menu.ip.lm2n.build.lwip_lib=-llwip2-536
wifiduino.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
wifiduino.menu.ip.hb2n=v2 Higher Bandwidth (no features)
wifiduino.menu.ip.hb2n.build.lwip_include=lwip2/include
wifiduino.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
wifiduino.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
wifiduino.menu.ip.lm6f=v2 IPv6 Lower Memory
wifiduino.menu.ip.lm6f.build.lwip_include=lwip2/include
wifiduino.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
wifiduino.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
wifiduino.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
wifiduino.menu.ip.hb6f.build.lwip_include=lwip2/include
wifiduino.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
wifiduino.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
wifiduino.menu.ip.hb1=v1.4 Higher Bandwidth
wifiduino.menu.ip.hb1.build.lwip_lib=-llwip_gcc
wifiduino.menu.ip.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
wifiduino.menu.ip.src=v1.4 Compile from source
wifiduino.menu.ip.src.build.lwip_lib=-llwip_src
wifiduino.menu.ip.src.build.lwip_flags=-DLWIP_OPEN_SRC
wifiduino.menu.ip.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
wifiduino.menu.dbg.Disabled=Disabled
wifiduino.menu.dbg.Disabled.build.debug_port=
wifiduino.menu.dbg.Serial=Serial
wifiduino.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
wifiduino.menu.dbg.Serial1=Serial1
wifiduino.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
wifiduino.menu.lvl.None____=None
wifiduino.menu.lvl.None____.build.debug_level=
wifiduino.menu.lvl.SSL=SSL
wifiduino.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
wifiduino.menu.lvl.TLS_MEM=TLS_MEM
wifiduino.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
wifiduino.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
wifiduino.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
wifiduino.menu.lvl.HTTP_SERVER=HTTP_SERVER
wifiduino.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
wifiduino.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
wifiduino.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
wifiduino.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
wifiduino.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
wifiduino.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
wifiduino.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
wifiduino.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
wifiduino.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
wifiduino.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
wifiduino.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
wifiduino.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
wifiduino.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
wifiduino.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
wifiduino.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
wifiduino.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
wifiduino.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
wifiduino.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
wifiduino.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
wifiduino.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
wifiduino.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
wifiduino.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
wifiduino.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
wifiduino.menu.lvl.CORE=CORE
wifiduino.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
wifiduino.menu.lvl.WIFI=WIFI
wifiduino.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
wifiduino.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
wifiduino.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
wifiduino.menu.lvl.UPDATER=UPDATER
wifiduino.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
wifiduino.menu.lvl.OTA=OTA
wifiduino.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
wifiduino.menu.lvl.OOM=OOM
wifiduino.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
wifiduino.menu.lvl.MDNS=MDNS
wifiduino.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
wifiduino.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
wifiduino.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
wifiduino.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
wifiduino.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
wifiduino.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
wifiduino.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
wifiduino.menu.wipe.none=Only Sketch
wifiduino.menu.wipe.none.upload.erase_cmd=version
wifiduino.menu.wipe.sdk=Sketch + WiFi Settings
wifiduino.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
wifiduino.menu.wipe.all=All Flash Contents
wifiduino.menu.wipe.all.upload.erase_cmd=erase_flash
wifiduino.menu.baud.921600=921600
wifiduino.menu.baud.921600.upload.speed=921600
wifiduino.menu.baud.57600=57600
wifiduino.menu.baud.57600.upload.speed=57600
wifiduino.menu.baud.115200=115200
wifiduino.menu.baud.115200.upload.speed=115200
wifiduino.menu.baud.230400.linux=230400
wifiduino.menu.baud.230400.macosx=230400
wifiduino.menu.baud.230400.upload.speed=230400
wifiduino.menu.baud.256000.windows=256000
wifiduino.menu.baud.256000.upload.speed=256000
wifiduino.menu.baud.460800.linux=460800
wifiduino.menu.baud.460800.macosx=460800
wifiduino.menu.baud.460800.upload.speed=460800
wifiduino.menu.baud.512000.windows=512000
wifiduino.menu.baud.512000.upload.speed=512000
wifiduino.menu.baud.3000000=3000000
wifiduino.menu.baud.3000000.upload.speed=3000000

